{
  "name" : "최은혁",
  "introduction" : null,
  "email" : "ehc28260@gmail.com",
  "phone" : "010-9411-0347",
  "photoUrl" : "https://phinf.pstatic.net/contact/20250718_283/1752825342992Bq6wC_JPEG/image.jpg?type=s160",
  "birth" : "1999-09-26",
  "address" : "경기도 용인시 기흥구 흥덕3로 20 1203동 1102호",
  "educations" : [ {
    "school" : "상현고등학교",
    "degree" : "인문계",
    "period" : "2015.03-2018.02"
  }, {
    "school" : "한동대학교",
    "degree" : "생명과학부/ICT융합학부",
    "period" : "2018.02-2024.02"
  } ],
  "experiences" : null,
  "skills" : "Java, React, Javascript, Python, R",
  "studentLife" : "저는 어릴 때부터 책 읽는 것을 좋아했으며, 특히 초등학생 시절부터 과학 관련 책에 깊은 관심을 가지고 있었습니다. 쉬는 시간이나 점심시간이 되면 항상 도서관으로 달려가 책에 푹 빠져 시간을 보냈습니다.\r\n\r\n중학생이 되면서 과학 서적에 대한 관심은 더욱 커졌고, 많은 책을 읽게 되었습니다. 그 결과 학교에서 가장 많은 책을 대출해 읽은 학생으로 표창을 받은 적도 있었습니다. 그런 저에게 사서 선생님은 “과학책뿐만 아니라 인문학적인 책도 함께 읽는 것이 중요하단다”라는 조언을 해주셨습니다. 당시 저는 일본 문화에 흥미를 갖고 있었기 때문에 그 조언을 계기로 히가시노 게이고의 『용의자 X의 헌신』이나 『방과 후』와 같은 추리소설을 접하게 되었고, 그것이 제가 일본 문화에 빠지게 된 계기가 되었습니다.\r\n\r\n고등학교 시절에는 학업에 쫓겨 자유롭게 책을 읽을 시간은 줄었지만, 친구들과 함께 일본 책을 읽는 습관은 계속되었습니다. 그 시기에는 주로 일본에서 유명한 라이트노벨을 읽었고, 문학 작품으로는 히가시노 게이고의 『나미야 잡화점의 기적』이나 『천공의 벌』 같은 책을 가끔 즐겨 읽었습니다. 저는 어릴 때부터 한자에 큰 흥미를 가지고 있어서, 항상 한자 사전을 들고 다니며 모르는 한자가 나오면 그 뜻이나 유래를 찾아보는 것이 즐거움이었습니다. 또한 일본어 영상 콘텐츠를 자막 없이 보는 것에도 도전하며 자연스럽게 일본어 청취 능력을 키워나갔습니다. 이러한 경험이 쌓이면서 지금도 일본어와 한자를 배우는 데에서 즐거움을 느끼고 있습니다.\r\n\r\n대학에서는 생명과학과 데이터 분석을 전공하였습니다. 연구에서는 폐수 중의 플록(미세 응집체)을 탐지하여 데이터 분석을 수행하고, 간단한 웹사이트를 구축했습니다. 또한 수업 프로젝트로는 우울증 환자의 데이터를 분석하여 증상의 탐지 및 개선 방안을 제시하는 소규모 웹사이트를 제작했습니다. 일본어 학습도 계속 이어가면서 새로운 어휘나 문법을 조금씩 익히고 있습니다.\r\n\r\n이러한 다양한 경험을 통해 저는 새로운 일에 적극적으로 도전하고, 여러 분야에 빠르게 적응하는 능력을 키울 수 있었습니다.",
  "strengthsWeaknesses" : "저의 강점 중 하나는 근면하고 꼼꼼한 성격이며, 시간을 엄수하는 태도를 중요하게 생각한다는 점입니다.\r\n어릴 적부터 저는 항상 주변으로부터 성실하고 진지한 학생이라는 평가를 받아왔습니다. 과제나 일은 반드시 기한 내에 마무리하는 것을 습관으로 삼고 있으며, 약속 시간에도 항상 10분 이상 일찍 도착하는 것이 사람으로서의 기본적인 예의라고 생각하고 있습니다.\r\n\r\n또한, 학습 학원에서 수학 시간강사를 맡았을 때에도, 학생들에게 어떻게 하면 더 잘 이해시킬 수 있을지 항상 고민하고, 수업 내용에 빠진 부분이 없는지 여러 번 확인했습니다. 그 결과 원장님으로부터 높은 평가를 받아, 수업 연장 제안을 받을 정도로 신뢰를 얻을 수 있었습니다.\r\n대학교에서는 프로젝트 리더로서 팀을 이끌며, 공동 지도교수님의 의견을 주의 깊게 경청했습니다. 그 내용을 분석해, 제가 담당한 데이터 분석 외의 부분까지도 포함하여 매주 진행 상황을 PPT로 정리해 팀원들과 공유함으로써 원활한 커뮤니케이션을 이끌어냈습니다.\r\n\r\n단점은, 어떤 내용을 완전히 이해했다고 확신이 들기까지 시간이 걸린다는 점입니다.\r\n불분명한 상태로 애매하게 넘어가는 것을 어려워하는 편이어서, 학습이나 작업에 다소 시간이 걸리는 경우가 있습니다. 이 단점을 극복하기 위해 최근에는 AI를 적극 활용하여 이해 속도를 높이려 노력하고 있습니다. 단순히 한 번의 질문으로 끝내는 것이 아니라, 이해가 부족한 부분이나 그 메커니즘에 대해 추가적으로 질문함으로써 보다 깊고 정확한 이해를 얻을 수 있도록 노력하고 있습니다.",
  "effortExperience" : "제가 인생에서 가장 열심히 노력했던 경험은 대학의 ICT융합학부에서 수행한 졸업 프로젝트입니다.\r\n대학에서는 Python과 R을 활용한 데이터 분석 및 관리 방법을 배웠지만, 졸업 프로젝트에서는 처음으로 실제 과제에 직면하며 그동안 배운 지식을 구체적인 성과로 보여주는 것이 필요했습니다.\r\n\r\n제가 맡은 프로젝트는 영상 분석 기술을 통해 산업 폐수의 정화 효율을 향상시키는 것이었습니다.\r\n구체적으로는 영상으로부터 불순물을 검출하고, 그 크기나 침강 속도 등의 다양한 데이터를 수집해 분석하는 작업이었습니다. 하지만 초기에는 데이터 분석 방법을 두고 팀원 간 의견이 엇갈려 프로젝트의 방향성이 불분명했고, 목표도 자주 변경되는 상황이었습니다.\r\n\r\n이 문제를 해결하기 위해 저는 팀 내에서 주도적인 역할을 맡아 적극적으로 커뮤니케이션 개선에 힘썼습니다.\r\n각 팀원이 자신이 생각하는 데이터 분석 방법을 명확히 제시하고, 정기적으로 의견을 나누는 시간을 갖자고 제안했습니다. 그 결과, 서로의 관점을 이해하고 존중하는 분위기가 조성되었고, 모두가 납득할 수 있는 통합 분석 방법을 확립할 수 있었습니다.\r\n\r\n또한 프로젝트 중반에는 서버에 문제가 발생해 스스로 해결해야 하는 상황도 있었습니다.\r\n서버 운영 경험이 전혀 없었지만, 주변 사람들의 조언과 인터넷을 통한 정보 탐색을 바탕으로 주도적으로 학습하며, 결국 문제를 무사히 해결할 수 있었습니다. 이 경험을 통해 저는 미지의 과제에도 유연하고 적극적으로 대응할 수 있는 역량을 기르게 되었습니다.\r\n\r\n또한 저는 Python을 활용해 고도화된 딥러닝 모델을 직접 설계하고 구축했습니다.\r\n데이터 전처리, 모델 학습, 하이퍼파라미터 조정, 분석 결과 해석까지 전 과정을 맡아 수행하였으며, 특히 불순물 검출의 정확도를 높이기 위해 노력한 결과, 최종적으로 True Positive Rate(진양성률) 93% 이상이라는 구체적인 성과를 달성할 수 있었습니다. 이 과정을 통해 이론 지식뿐 아니라 실제 업무에 바로 적용할 수 있는 기술력을 비약적으로 향상시킬 수 있었습니다.\r\n\r\n이번 졸업 프로젝트를 통해, 어려운 상황에서도 주도적으로 문제를 해결하고 팀과의 원활한 협력이 결과에 직결된다는 것을 깊이 체감했습니다.\r\n이 경험을 바탕으로, 사회에 나가 다양한 과제에 직면하더라도 적극적이고 유연하게 대응할 수 있는 인재가 되기를 목표로 하고 있습니다.",
  "japanItMotivation" : "저는 어릴 때부터 한자에 깊은 흥미를 가지고 스스로 한자 공부를 시작했습니다. 그 연장선에서 한자능력검정시험에도 도전하게 되었고, 합격을 거듭하면서 한자에 대한 흥미는 더욱 깊어졌습니다.\r\n또한 중학생 시절부터 일본 문화에 매료되어 본격적으로 일본어 공부를 시작하였으며, 특히 일본어는 한국어에 비해 한자의 사용 빈도가 높아 읽는 과정 자체가 즐거웠고, 그만큼 스스로의 성장을 실감할 수 있었습니다.\r\n\r\n고등학교부터 대학교에 이르기까지, 일본어 학습을 공통의 취미로 삼은 친구들과 동아리 활동을 함께 하며 계속해서 공부를 이어갔습니다.\r\n그 과정에서 같은 동아리에서 프로그래밍을 함께 배우던 친구들과 미래에 대해 이야기를 나눌 기회가 있었고, 그때 일본의 IT 기업에 취업하는 것이 우리의 공동된 목표가 되었습니다.\r\n우리 모두가 일본 문화에 친숙하고, 일본에서의 삶을 꿈꾸고 있었기에 같은 목표를 향해 서로 격려하고 협력하면서 준비를 계속해 왔습니다.\r\n\r\n현재 저는 이 꿈을 실현하기 위해 IT 분야에 대한 공부를 한층 더 심화시키고 있으며, 일본의 IT 기업에서 제 힘으로 성과를 낼 수 있도록 최선을 다하고자 합니다.",
  "futurePlan" : "저는 지금까지의 학습과 경험을 통해 쌓아온 데이터 분석 능력과 프로그래밍 역량을 바탕으로, 일본의 IT 기업에서 백엔드 엔지니어로 활약하고 싶습니다.\r\n\r\n입사 후에는 우선 기업의 서비스 구조와 개발 프로세스를 신속히 파악하여, 즉시 실무에 투입될 수 있는 신뢰받는 엔지니어가 되는 것을 목표로 하고 있습니다. 현재는 Java와 Spring Boot를 중심으로 백엔드 개발을 학습하고 있으며, 이러한 지식을 바탕으로 견고하고 확장 가능한 시스템 구축에 기여하고자 합니다.\r\n\r\n또한, 일본어 능력을 활용하여 팀 내 및 고객과의 원활한 커뮤니케이션을 통해 프로젝트의 성공을 뒷받침하는 존재가 되는 것을 목표로 하고 있습니다."
}